# InternalDefinition Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition Class
Members See Also
---
This object represents a parameter definition in an Autodesk Revit model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InternalDefinition : Definition,
	IDisposable
```

Visual Basic
---
```text
Public Class InternalDefinition _
	Inherits Definition _
	Implements IDisposable
```

Visual C++
---
```text
public ref class InternalDefinition : public Definition,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Definition Autodesk.Revit.DB..::..InternalDefinition
# See Also
InternalDefinition Members
Autodesk.Revit.DB Namespace